In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pylab as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01 -0.880800  0.841423  1.631564  0.787927
2013-01-02  1.733342  1.885847  0.975100 -1.001074
2013-01-03  1.003690 -0.545395  0.154319 -0.466668
2013-01-04  0.060065 -0.891550  0.425294  0.084116
2013-01-05  2.076679 -0.931975  0.151967 -0.278135
2013-01-06 -0.529200  0.971958 -1.634468 -0.621862

In [10]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df.head()

                   A         B         C         D
2013-01-01 -0.880800  0.841423  1.631564  0.787927
2013-01-02  1.733342  1.885847  0.975100 -1.001074
2013-01-03  1.003690 -0.545395  0.154319 -0.466668
2013-01-04  0.060065 -0.891550  0.425294  0.084116
2013-01-05  2.076679 -0.931975  0.151967 -0.278135

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.060065 -0.891550  0.425294  0.084116
2013-01-05  2.076679 -0.931975  0.151967 -0.278135
2013-01-06 -0.529200  0.971958 -1.634468 -0.621862

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.values

array([[-0.8808    ,  0.8414226 ,  1.63156382,  0.78792662],
       [ 1.73334208,  1.88584743,  0.97510048, -1.00107359],
       [ 1.00369025, -0.54539472,  0.15431898, -0.46666825],
       [ 0.06006515, -0.89154972,  0.42529428,  0.08411609],
       [ 2.07667867, -0.93197504,  0.15196717, -0.27813476],
       [-0.52920048,  0.97195825, -1.63446778, -0.62186204]])

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.577296  0.221718  0.283963 -0.249283
std    1.215262  1.172609  1.098024  0.622744
min   -0.880800 -0.931975 -1.634468 -1.001074
25%   -0.381884 -0.805011  0.152555 -0.583064
50%    0.531878  0.148014  0.289807 -0.372402
75%    1.550929  0.939324  0.837649 -0.006447
max    2.076679  1.885847  1.631564  0.787927

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.880800    1.733342    1.003690    0.060065    2.076679   -0.529200
B    0.841423    1.885847   -0.545395   -0.891550   -0.931975    0.971958
C    1.631564    0.975100    0.154319    0.425294    0.151967   -1.634468
D    0.787927   -1.001074   -0.466668    0.084116   -0.278135   -0.621862

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.787927  1.631564  0.841423 -0.880800
2013-01-02 -1.001074  0.975100  1.885847  1.733342
2013-01-03 -0.466668  0.154319 -0.545395  1.003690
2013-01-04  0.084116  0.425294 -0.891550  0.060065
2013-01-05 -0.278135  0.151967 -0.931975  2.076679
2013-01-06 -0.621862 -1.634468  0.971958 -0.529200

In [20]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  2.076679 -0.931975  0.151967 -0.278135
2013-01-04  0.060065 -0.891550  0.425294  0.084116
2013-01-03  1.003690 -0.545395  0.154319 -0.466668
2013-01-01 -0.880800  0.841423  1.631564  0.787927
2013-01-06 -0.529200  0.971958 -1.634468 -0.621862
2013-01-02  1.733342  1.885847  0.975100 -1.001074

In [21]:
df['A']

2013-01-01   -0.880800
2013-01-02    1.733342
2013-01-03    1.003690
2013-01-04    0.060065
2013-01-05    2.076679
2013-01-06   -0.529200
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.880800  0.841423  1.631564  0.787927
2013-01-02  1.733342  1.885847  0.975100 -1.001074
2013-01-03  1.003690 -0.545395  0.154319 -0.466668

In [23]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.733342  1.885847  0.975100 -1.001074
2013-01-03  1.003690 -0.545395  0.154319 -0.466668
2013-01-04  0.060065 -0.891550  0.425294  0.084116

In [24]:
df.loc[dates[0]]

A   -0.880800
B    0.841423
C    1.631564
D    0.787927
Name: 2013-01-01 00:00:00, dtype: float64

In [25]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.880800  0.841423
2013-01-02  1.733342  1.885847
2013-01-03  1.003690 -0.545395
2013-01-04  0.060065 -0.891550
2013-01-05  2.076679 -0.931975
2013-01-06 -0.529200  0.971958

In [26]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.733342  1.885847  0.975100 -1.001074
2013-01-03  1.003690 -0.545395  0.154319 -0.466668
2013-01-04  0.060065 -0.891550  0.425294  0.084116
2013-01-05  2.076679 -0.931975  0.151967 -0.278135

In [27]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.841423  1.631564  0.787927
2013-01-02  1.733342  1.885847  0.975100       NaN
2013-01-03  1.003690       NaN  0.154319       NaN
2013-01-04  0.060065       NaN  0.425294  0.084116
2013-01-05  2.076679       NaN  0.151967       NaN
2013-01-06       NaN  0.971958       NaN       NaN

In [28]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [29]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [30]:
df['F'] = s1

In [31]:
df[:10]

                   A         B         C         D    F
2013-01-01 -0.880800  0.841423  1.631564  0.787927  NaN
2013-01-02  1.733342  1.885847  0.975100 -1.001074  1.0
2013-01-03  1.003690 -0.545395  0.154319 -0.466668  2.0
2013-01-04  0.060065 -0.891550  0.425294  0.084116  3.0
2013-01-05  2.076679 -0.931975  0.151967 -0.278135  4.0
2013-01-06 -0.529200  0.971958 -1.634468 -0.621862  5.0

In [32]:
df.at[dates[0],'A'] = 0

In [33]:
df.iat[0,1] = 0

In [34]:
df.loc[:,'D'] = np.array([5] * len(df))

In [35]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.631564  5  NaN
2013-01-02  1.733342  1.885847  0.975100  5  1.0
2013-01-03  1.003690 -0.545395  0.154319  5  2.0
2013-01-04  0.060065 -0.891550  0.425294  5  3.0
2013-01-05  2.076679 -0.931975  0.151967  5  4.0
2013-01-06 -0.529200  0.971958 -1.634468  5  5.0

In [36]:
df2 = df.copy()

In [37]:
df2[df2 > 0] = -df2

In [38]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.631564 -5  NaN
2013-01-02 -1.733342 -1.885847 -0.975100 -5 -1.0
2013-01-03 -1.003690 -0.545395 -0.154319 -5 -2.0
2013-01-04 -0.060065 -0.891550 -0.425294 -5 -3.0
2013-01-05 -2.076679 -0.931975 -0.151967 -5 -4.0
2013-01-06 -0.529200 -0.971958 -1.634468 -5 -5.0

In [39]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [40]:
df1.dropna(how='any')

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [41]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  1.631564  5  NaN NaN
2013-01-02  1.733342  1.885847  0.975100  5  1.0 NaN
2013-01-03  1.003690 -0.545395  0.154319  5  2.0 NaN
2013-01-04  0.060065 -0.891550  0.425294  5  3.0 NaN

In [42]:
sl

NameError: name 'sl' is not defined